__author__ = 'Magomedov Ramazan'

# Задача-1: Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

name = input("Введите ваше имя: ")
age = int(input("Введите ваш возраст: "))
c = float(input("Введите ваше любимое число: "))

print('Привет, я '+ name +', мне ' + str(age) + ' лет, моё любимое число: '+ str(c))